[
    {
        "id" :  0,
        "gameTitle": "Ghost from the past",
        "gameUrl":"https://srdenso.itch.io/ghosts-from-the-past",
        "videoUrl":"https://youtu.be/PFICCq2xTAw",
        "description": "A game I made for the Halloween Game Jam 2024 under the theme \"Haunting Memories\". It is a platformer about someone chasing the fragments of the memory. \n I created all the art, sound, and programming, and the game ranked 10th in the jam."
    },
    {
        "id" :  4,
        "gameTitle": "Space Adventure",
        "gameUrl":"https://srdenso.itch.io/spaceadventure",
        "videoUrl":"https://youtube.com/shorts/1FOKKkj5O9o?feature=share",
        "description":"I made this game for a game development course I took. Basically, it's a sort of bullet hell. \n The fun part was programming the behavior of the enemy ships."
    },
    {
        "id" :  1,
        "gameTitle": "Thief Mouse",
        "gameUrl":"https://srdenso.itch.io/thief-mouse",
        "videoUrl":"https://youtu.be/UKhiiVdTtlE",
        "description":"This is another game I made for a jam in 2021. It's about a little mouse who has to collect all the cheese without the cats guarding the house noticing. In this case, I focused on programming and got help with the art and music."
    },
    {
        "id" :  2,
        "gameTitle": "Fast Ball",
        "gameUrl":"https://srdenso.itch.io/fastball",
        "videoUrl":"https://youtu.be/8YkILe7zfF4",
        "description":"I made this game for the 20-Second Game Jam in 2022. As the name of the jam suggests, this game only lasts 20 seconds, so try to score as many points as possible and climb the leaderboard!"
    },
    {
        "id" :  3,
        "gameTitle": "Space Duel",
        "gameUrl":"https://srdenso.itch.io/space-duel",
        "videoUrl":"https://youtu.be/PRdUUaUmjvk",
        "description":"This one is a little pation project i have in the making. It was inspired on pen and paper game i played as a kid.\n The main idea is that each player puts their ships without the other seeing and then they have to try to guess the location and shoot the other's."
    }
    ,
    {
        "id" :  4,
        "gameTitle": "Unnamed game",
        "gameUrl":"",
        "videoUrl":"https://youtu.be/6RbIRfA-6q8",
        "description":"This is a personal project I started working on a little while ago. It's a fairly standard action-adventure game, and I started it to challenge myself in areas I haven't worked in much, like 3D modeling and shaders.\n The second half of the video showcases a shader I made for the character's sword. The idea is that these are magic swords, so I created a noise pattern to give them an ethereal look.\n This game is not published yet."
    }
    
]
